import streamlit as st

""" 
# Метод конечных элементов
##### Филиал МГУ имени М.В.Ломоносова, г. Саров 

## Вабищевич П.Н.
vabishchevich@gmail.com"

#### Практические занятия

**Обучающий трек**

* Подготовка отчетных материалов: Streamlit
* Математический Python: NumPy, SciPy
* Научная визуализация: Matlotlib, ParaView, pyVista
* Генератор сеток: Gmsh
* Среда разработки: Jupyter-ноутбук

**Подготовительный этап**

* Математические модели течений несжимаемой жидкости
* Пример: численное исследование обтекания цилиндра в плоском канале
* Задания для проектной работы

**Работа над проектом**

* Самостоятельная работа в составе проектной группы
* Защита проекта

"""
