import streamlit as st

r"""
##### Задания

**Содержание работы**

- Самостоятельная работа по теме
- Презентация с обсуждением на семинаре
- Доработка презентации
- Выкладывание материалов в общую папку проекта


**Список заданий: номер проекта, тема**

"""

c1, c2, = st.columns(2)

c1.write("""
**ВМ-2025**

   * 1 - Streamlit   
   * 2 - Matplotlib
   * 3 - SciPy
   * 4 - Gmsh
""")

c2.write("""
**СКТ-2025**

   * 1 - ParaView   
   * 2 - pyVista
   * 3 - Jupyter Notebook
   * 4 - Gmsh
""")


