import streamlit as st

r"""
##### Генерация сеток: Gmsh

**Информация + работающие примеры**

* Общая характеристика ПО

* Геометрические элементы

* Установка

* Файл геометрии 

* Создание области 

* Интерактивные возможности создания области

* Составные области

* Маркирование подобластей и частей границ

* Генерация сетки

* Сгущение сетки

* Подготовка сетки для FEniCS

* Constructive Solid Geometry технология в Gmsh

* Библиотеки Python pygmsh и meshio

* ...

"""

st.link_button(":globe_with_meridians: Документация",  "https://gmsh.info/#Documentation/")


